tutorials/fluid/gearPump2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    piston
    {
        type            zeroGradient;
    }

    liner
    {
        type            zeroGradient;
    }

    cylinderHead
    {
        type            zeroGradient;
    }

    ivHead
    {
        type            zeroGradient;
    }

    ivStem
    {
        type            zeroGradient;
    }

    evHead
    {
        type            zeroGradient;
    }

    evStem
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
